html/20231218T052730--creating-a-simple-emacs-package__elisp_emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-20 Wed 09:12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>creating  a simple emacs package</title>
<meta name="author" content="Arvydas Gasparavicius" />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../static/css/org-html-style-default.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/generic.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/taingram.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/lightbox.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/scroll-to-top.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html">NOTES </a>
 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="updated">Updated: 2023-12-18 Mon 07:31</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">creating  a simple emacs package</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org45c6909">1. Steps to execute to create your own emacs package</a>
<ul>
<li><a href="#org888baf9">1.1. Create a Package Directory Structure</a></li>
<li><a href="#org3767334">1.2. Write the Package Code</a></li>
<li><a href="#org7f8f53b">1.3. Create the Package Metadata</a></li>
<li><a href="#org35a7a32">1.4. Load the Package</a></li>
<li><a href="#org6edf74f">1.5. Usage</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-12-18 Mon] </span></span> I wanted to find a way how to override a function in Emacs.
After a few unsuccessful attempts, I thought okay I first must understand how
packages work in Emacs.
</p>

<p>
So researched a simple way to create one.
</p>

<div id="outline-container-org45c6909" class="outline-2">
<h2 id="org45c6909"><span class="section-number-2">1.</span> Steps to execute to create your own emacs package</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org888baf9" class="outline-3">
<h3 id="org888baf9"><span class="section-number-3">1.1.</span> Create a Package Directory Structure</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Create a directory named <code>my-word-counter</code> (or any preferred name) within your
Emacs configuration folder.
</p>
</div>
</div>

<div id="outline-container-org3767334" class="outline-3">
<h3 id="org3767334"><span class="section-number-3">1.2.</span> Write the Package Code</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Inside the <code>my-word-counter</code> directory, create a file named
<code>my-word-counter.el</code> and write the following Emacs Lisp code:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;;; my-word-counter.el --- A simple Emacs package to count words in the buffer.

;;;###autoload
(defun my-word-counter ()
  "Count the number of words in the current buffer."
  (interactive)
  (message "Number of words in the buffer: %d" (count-words (point-min) (point-max))))

;; Provide the feature
(provide 'my-word-counter)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f8f53b" class="outline-3">
<h3 id="org7f8f53b"><span class="section-number-3">1.3.</span> Create the Package Metadata</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In the <code>my-word-counter</code> directory, create a file named
<code>my-word-counter-pkg.el</code> to define package metadata:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-package "my-word-counter" "1.0" "A simple package to count words in Emacs.")
</pre>
</div>
</div>
</div>

<div id="outline-container-org35a7a32" class="outline-3">
<h3 id="org35a7a32"><span class="section-number-3">1.4.</span> Load the Package</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Add code to your Emacs configuration file (~/.emacs or ~/.emacs.d/init.el) to
add the directory containing your package to the load path and load the
package:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Add the package directory to load-path
(add-to-list 'load-path "~/.emacs.d/my-word-counter")

;; Load the package
(require 'my-word-counter)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6edf74f" class="outline-3">
<h3 id="org6edf74f"><span class="section-number-3">1.5.</span> Usage</h3>
<div class="outline-text-3" id="text-1-5">
<p>
After following these steps, you can use the <code>my-word-counter</code> package in
Emacs. Open a buffer and execute <code>M-x my-word-counter</code>. It should display a
message with the count of words in the buffer.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>
	 <footer>
	 <div class="copyright-container">
	 <div class="copyright">
	 Copyright &copy; 2023-2023 Arvydas Gasparavicius
	 </div>
	 </div>
	 <p class="date">This org file is created: 2023-12-18 Mon 05:27</p>
	 <p class="date">This org file is last modified: 2023-12-18 Mon 07:31</p>
	 <p class="date">This org file is exported to HTML: 2023-12-20 Wed 09:12</p>
	 <div class="generated">
	Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6) on <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a>
	</div>
	</footer>
	 <button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>
	 <script src="../static/js/generic.js"></script>
	 <script src="../static/js/scroll-to-top.js"></script>
	 <script src="../static/js/lightbox.js"></script>
</div>
</body>
</html>